import React, { useState } from 'react'
import MyNavbar from '../../Components/MyNavbar/MyNavbar'
import Header from '../../Components/Header/Header'
import MyFooter from '../../Components/MyFooter/MyFooter'
import womenImg from "../../Assets/Images/Photo.png"
import { FaArrowDown } from "react-icons/fa6";
import { RiArrowDownSFill } from "react-icons/ri";

const SelectedProduct = () => {
    return (
        <div>
            <Header />
            <hr />
            <div className='max-w-[1224px] m-auto'>
                <MyNavbar />

                <div className='flex mt-8'>
                    <div>
                        <div className='w-[670px] flex gap-9'>

                            <div className='flex flex-col gap-6 items-center justify-center'>
                                <div>
                                    <img className='rounded-lg w-[104px] h-[100px]' src={womenImg} alt="" />
                                </div>
                                <div>
                                    <img className='rounded-lg w-[104px] h-[100px]' src={womenImg} alt="" />
                                </div>
                                <div>
                                    <img className='rounded-lg w-[104px] h-[100px]' src={womenImg} alt="" />
                                </div>
                                <div>
                                    <img className='rounded-lg w-[104px] h-[100px]' src={womenImg} alt="" />
                                </div>
                                <div className="w-10 h-10 rounded-full border-2 flex justify-center items-center border-solid border-baseRed ">
                                    <FaArrowDown className='fill-baseRed' />
                                </div>

                            </div>
                            <div className="relative w-[530px] ">
                                <img
                                    src={womenImg}
                                    alt="Product"
                                    className="w-full"
                                />

                                <div className="absolute bottom-0 w-full h-[64px] rounded-lg backdrop-blur-md bg-white/40 flex items-center justify-center">
                                    <div className="flex flex-row-reverse gap-4 items-center">
                                        <span className="w-6 h-6 rounded-full bg-white border border-gray-300 cursor-pointer"></span>
                                        <span className="w-6 h-6 rounded-full bg-black border border-gray-300 cursor-pointer"></span>
                                        <span className="w-8 h-8 rounded-full bg-baseRed border border-gray-300 cursor-pointer flex justify-center items-center"><svg width="14" height="10" viewBox="0 0 14 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M5.10594 9.77151C4.83927 9.77151 4.58594 9.66484 4.39927 9.47818L0.625937 5.70484C0.239271 5.31818 0.239271 4.67818 0.625937 4.29151C1.0126 3.90484 1.6526 3.90484 2.03927 4.29151L5.10594 7.35818L11.9593 0.504844C12.3459 0.118177 12.9859 0.118177 13.3726 0.504844C13.7593 0.89151 13.7593 1.53151 13.3726 1.91818L5.8126 9.47818C5.62594 9.66484 5.3726 9.77151 5.10594 9.77151Z" fill="white" />
                                        </svg>
                                        </span>
                                        <span className="w-6 h-6 rounded-full bg-[#00BA88] border border-gray-300 cursor-pointer"></span>
                                        <span className="w-6 h-6 rounded-full bg-yellow-400 border border-gray-300 cursor-pointer"></span>
                                    </div>
                                </div>
                            </div>



                        </div>
                    </div>
                    <div className='mr-8 mt-8'>
                        <div>
                            <h1 className='text-baseRed text-2xl font-bold'>مشخصات محصول</h1>
                        </div>
                        <hr className='my-4 w-[519px]' />
                        <div className='text-[#434343] text-xl flex flex-col gap-3 mb-4'>
                            <p>جنس: نخ، پلی استر</p>
                            <p>شستشو: با دست</p>
                            <p>سایز ها: S, M, L, XL, XXL, XXXL </p>
                            <p>رنگ ها: مشکی، سفید، قرمز، سبز، نارنجی، زرشکی، بنفش</p>
                            <p>قد: ۶۰ سانتی متر </p>
                        </div>
                        <div>
                            <button className='w-[93px] border border-solid border-baseRed text-baseRed rounded-lg flex justify-center items-center h-12 gap-2'>
                                <p className='font-bold'>M</p>
                                <RiArrowDownSFill className='w-6 h-6' />

                            </button>
                        </div>
                        <div className='flex flex-col justify-between items-end h-[146px]'>
                            <p className='font-bold text-2xl'> ۱۲۷,۰۰۰ تومان</p>
                            <div className='flex gap-6'>
                              
                                <button className='bg-white border border-solid border-baseRed w-[184px] h-12 rounded-lg flex justify-center items-center px-2 text-sm' >
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M5.00086 21.8689C4.26086 21.8689 3.53086 21.5889 2.97086 21.0289C2.43086 20.4889 2.13086 19.7689 2.13086 18.9989C2.13086 18.2289 2.43086 17.5089 2.97086 16.9689L15.9709 3.96891C17.0909 2.84891 18.9109 2.84891 20.0309 3.96891C20.5709 4.50891 20.8709 5.22891 20.8709 5.99891C20.8709 6.76891 20.5709 7.48891 20.0309 8.02891L7.03086 21.0289C6.47086 21.5889 5.74086 21.8689 5.00086 21.8689ZM18.0009 4.62891C17.6509 4.62891 17.3009 4.75891 17.0309 5.02891L4.03086 18.0289C3.77086 18.2889 3.63086 18.6289 3.63086 18.9989C3.63086 19.3689 3.77086 19.7089 4.03086 19.9689C4.56086 20.4989 5.44086 20.4989 5.97086 19.9689L18.9709 6.96891C19.2309 6.70891 19.3709 6.36891 19.3709 5.99891C19.3709 5.62891 19.2309 5.28891 18.9709 5.02891C18.7009 4.75891 18.3509 4.62891 18.0009 4.62891Z" fill="#A72F3B" />
                                        <path d="M18.0092 9.73969C17.8192 9.73969 17.6292 9.66969 17.4792 9.51969L14.4792 6.51969C14.1892 6.22969 14.1892 5.74969 14.4792 5.45969C14.7692 5.16969 15.2492 5.16969 15.5392 5.45969L18.5392 8.45969C18.8292 8.74969 18.8292 9.22969 18.5392 9.51969C18.3892 9.66969 18.1992 9.73969 18.0092 9.73969Z" fill="#A72F3B" />
                                        <path d="M9.99907 5.49907C9.94907 5.49907 9.90907 5.48907 9.85907 5.47907L8.49907 5.07907L7.13907 5.47907C6.95907 5.52908 6.76907 5.47907 6.64907 5.34907C6.51907 5.21907 6.46907 5.03908 6.51907 4.85908L6.91907 3.49907L6.51907 2.13907C6.46907 1.95907 6.51907 1.76907 6.64907 1.64907C6.77907 1.51907 6.96907 1.46907 7.13907 1.51907L8.49907 1.91907L9.85907 1.51907C10.0391 1.46907 10.2191 1.51907 10.3491 1.64907C10.4791 1.77907 10.5291 1.96907 10.4791 2.13907L10.0791 3.49907L10.4791 4.85908C10.5291 5.03908 10.4791 5.22907 10.3491 5.34907C10.2591 5.44907 10.1291 5.49907 9.99907 5.49907ZM8.49907 4.05907C8.54907 4.05907 8.58908 4.06907 8.63908 4.07907L9.25908 4.25908L9.07907 3.63908C9.04907 3.54908 9.04907 3.44907 9.07907 3.35907L9.25908 2.73907L8.63908 2.91907C8.54908 2.94907 8.44907 2.94907 8.35907 2.91907L7.73907 2.73907L7.91907 3.35907C7.94907 3.44907 7.94907 3.54908 7.91907 3.63908L7.73907 4.25908L8.35907 4.07907C8.40907 4.06907 8.44907 4.05907 8.49907 4.05907Z" fill="#A72F3B" />
                                        <path d="M5.99907 11.4991C5.94907 11.4991 5.90908 11.4891 5.85908 11.4791L4.49907 11.0791L3.13907 11.4791C2.95907 11.5291 2.77907 11.4791 2.64907 11.3491C2.51907 11.2191 2.46907 11.0291 2.51907 10.8591L2.91907 9.49907L2.51907 8.13908C2.46907 7.95908 2.51907 7.76907 2.64907 7.64907C2.77907 7.52907 2.96907 7.46907 3.13907 7.51907L4.49907 7.91907L5.85908 7.51907C6.02908 7.46907 6.21907 7.51907 6.34907 7.64907C6.47907 7.77907 6.52908 7.96908 6.47907 8.13908L6.07907 9.49907L6.47907 10.8591C6.52908 11.0391 6.47907 11.2291 6.34907 11.3491C6.25907 11.4491 6.12908 11.4991 5.99907 11.4991ZM4.49907 10.0591C4.54907 10.0591 4.58907 10.0691 4.63907 10.0791L5.25908 10.2591L5.07907 9.63908C5.04907 9.54908 5.04907 9.44907 5.07907 9.35907L5.25908 8.73907L4.63907 8.91907C4.54907 8.94907 4.44907 8.94907 4.35907 8.91907L3.73907 8.73907L3.91907 9.35907C3.94907 9.44907 3.94907 9.54908 3.91907 9.63908L3.73907 10.2591L4.35907 10.0791C4.40907 10.0691 4.44907 10.0591 4.49907 10.0591Z" fill="#A72F3B" />
                                        <path d="M20.9991 16.4991C20.9491 16.4991 20.9091 16.4891 20.8591 16.4791L19.4991 16.0791L18.1391 16.4791C17.9591 16.5291 17.7791 16.4791 17.6491 16.3491C17.5191 16.2191 17.4691 16.0291 17.5191 15.8591L17.9191 14.4991L17.5191 13.1391C17.4691 12.9591 17.5191 12.7691 17.6491 12.6491C17.7791 12.5291 17.9691 12.4691 18.1391 12.5191L19.4991 12.9191L20.8591 12.5191C21.0291 12.4691 21.2191 12.5191 21.3491 12.6491C21.4791 12.7791 21.5291 12.9691 21.4791 13.1391L21.0791 14.4991L21.4791 15.8591C21.5291 16.0391 21.4791 16.2291 21.3491 16.3491C21.2591 16.4491 21.1291 16.4991 20.9991 16.4991ZM19.4991 15.0591C19.5491 15.0591 19.5891 15.0691 19.6391 15.0791L20.2591 15.2591L20.0791 14.6391C20.0491 14.5491 20.0491 14.4491 20.0791 14.3591L20.2591 13.7391L19.6391 13.9191C19.5491 13.9491 19.4491 13.9491 19.3591 13.9191L18.7391 13.7391L18.9191 14.3591C18.9491 14.4491 18.9491 14.5491 18.9191 14.6391L18.7391 15.2591L19.3591 15.0791C19.4091 15.0691 19.4491 15.0591 19.4991 15.0591Z" fill="#A72F3B" />
                                    </svg>


                                    <p className='m-2 text-baseRed'>شخصی سازی محصول</p>
                                </button>
                                <button className='bg-baseRed w-[184px] h-12 rounded-lg flex justify-center items-center' >
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M18.19 17.75H7.53999C6.54999 17.75 5.59999 17.33 4.92999 16.6C4.25999 15.87 3.92 14.89 4 13.9L4.83 3.94C4.86 3.63 4.74999 3.33001 4.53999 3.10001C4.32999 2.87001 4.04 2.75 3.73 2.75H2C1.59 2.75 1.25 2.41 1.25 2C1.25 1.59 1.59 1.25 2 1.25H3.74001C4.47001 1.25 5.15999 1.56 5.64999 2.09C5.91999 2.39 6.12 2.74 6.23 3.13H18.72C19.73 3.13 20.66 3.53 21.34 4.25C22.01 4.98 22.35 5.93 22.27 6.94L21.73 14.44C21.62 16.27 20.02 17.75 18.19 17.75ZM6.28 4.62L5.5 14.02C5.45 14.6 5.64 15.15 6.03 15.58C6.42 16.01 6.95999 16.24 7.53999 16.24H18.19C19.23 16.24 20.17 15.36 20.25 14.32L20.79 6.82001C20.83 6.23001 20.64 5.67001 20.25 5.26001C19.86 4.84001 19.32 4.60999 18.73 4.60999H6.28V4.62Z" fill="white" />
                                        <path d="M16.25 22.75C15.15 22.75 14.25 21.85 14.25 20.75C14.25 19.65 15.15 18.75 16.25 18.75C17.35 18.75 18.25 19.65 18.25 20.75C18.25 21.85 17.35 22.75 16.25 22.75ZM16.25 20.25C15.97 20.25 15.75 20.47 15.75 20.75C15.75 21.03 15.97 21.25 16.25 21.25C16.53 21.25 16.75 21.03 16.75 20.75C16.75 20.47 16.53 20.25 16.25 20.25Z" fill="white" />
                                        <path d="M8.25 22.75C7.15 22.75 6.25 21.85 6.25 20.75C6.25 19.65 7.15 18.75 8.25 18.75C9.35 18.75 10.25 19.65 10.25 20.75C10.25 21.85 9.35 22.75 8.25 22.75ZM8.25 20.25C7.97 20.25 7.75 20.47 7.75 20.75C7.75 21.03 7.97 21.25 8.25 21.25C8.53 21.25 8.75 21.03 8.75 20.75C8.75 20.47 8.53 20.25 8.25 20.25Z" fill="white" />
                                        <path d="M21 8.75H9C8.59 8.75 8.25 8.41 8.25 8C8.25 7.59 8.59 7.25 9 7.25H21C21.41 7.25 21.75 7.59 21.75 8C21.75 8.41 21.41 8.75 21 8.75Z" fill="white" />
                                    </svg>

                                    <p className='m-2 text-white'>افزودن  به سبد</p>
                                </button>
                            </div>
                        </div>
                    </div>
                </div>



            </div>
            <MyFooter />
        </div>
    )
}

export default SelectedProduct